In [51]:
import pandas as pd
import numpy as np

In [2]:
#Matematiksel anlamda numpy teorik, pandas fataframe ise daha analitik

In [3]:
l = [4,4,56,7,46,9,44]

In [4]:
pd.DataFrame(l,columns=["Degisken_Ismi"])

   Degisken_Ismi
0              4
1              4
2             56
3              7
4             46
5              9
6             44

In [8]:
m = np.arange(1,10).reshape((3,3))

In [10]:
pd.DataFrame(m,columns=["Var1","Var2","Var3"])

   Var1  Var2  Var3
0     1     2     3
1     4     5     6
2     7     8     9

In [ ]:
#df isimlendirme

In [11]:
df = pd.DataFrame(m,columns=["Var1","Var2","Var3"])

In [14]:
df.head(2)

   Var1  Var2  Var3
0     1     2     3
1     4     5     6

In [16]:
df.columns = ("deg1","deg2","deg3")

In [17]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
df.ndim

2

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
df.shape

(3, 3)

In [22]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [23]:
df.size

9

In [25]:
df.values # Array formatına çevirdi

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [26]:
a = np.array([1,3,2,4,6])

In [27]:
pd.DataFrame(a,columns = ["deg1"])

   deg1
0     1
1     3
2     2
3     4
4     6

In [28]:
#Eleman İşlemleri

In [6]:
s1=np.random.randint(10,size = 5)
s2=np.random.randint(10,size = 5)
s3=np.random.randint(10,size = 5)

In [7]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}
sozluk

{'var1': array([8, 5, 8, 1, 3]),
 'var2': array([8, 9, 4, 1, 7]),
 'var3': array([6, 3, 0, 3, 6])}

In [8]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     8     8     6
1     5     9     3
2     8     4     0
3     1     1     3
4     3     7     6

In [12]:
df[0:2]

   var1  var2  var3
a     8     8     6
b     5     9     3

In [10]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     8     8     6
b     5     9     3
c     8     4     0
d     1     1     3
e     3     7     6

In [11]:
df["c":"e"]

   var1  var2  var3
c     8     4     0
d     1     1     3
e     3     7     6

In [ ]:
#Silme

In [47]:
df.drop("a",axis = 0)

   var1  var2  var3
b     3     5     0
c     1     8     7
d     4     2     2
e     8     6     6

In [48]:
df

   var1  var2  var3
a     8     2     2
b     3     5     0
c     1     8     7
d     4     2     2
e     8     6     6

In [55]:
df.drop("a",axis = 0,inplace=True)

In [54]:
df

   var1  var2  var3
b     3     5     0
c     1     8     7
d     4     2     2
e     8     6     6

In [56]:
#Fancy ile silme işlemleri

In [57]:
li = ["c","e"]

In [59]:
df.drop(li, axis = 0)

   var1  var2  var3
b     3     5     0
d     4     2     2

In [60]:
#Degiskenler

In [61]:
"var1" in df

True

In [62]:
liste = ["var1","var4","var2"]

In [63]:
for i in liste:
    print(i in df)

True
False
True

In [64]:
df

   var1  var2  var3
b     3     5     0
c     1     8     7
d     4     2     2
e     8     6     6

In [65]:
df["var4"] = df["var2"] *df["var1"]

In [66]:
df

   var1  var2  var3  var4
b     3     5     0    15
c     1     8     7     8
d     4     2     2     8
e     8     6     6    48

In [67]:
#Değişken Silmek

In [71]:
df.drop("var4",axis = 1 ,inplace = True)

In [72]:
p = ["var1","var2"]

In [73]:
df.drop(p,axis = 1)

   var3
b     0
c     7
d     2
e     6

In [ ]:
#Gözlem ve Değişken Seçimi/// En Sık Karşılaşılan Problemler.

In [19]:
import numpy as np
import pandas as pd

In [52]:
m = np.random.randint(1,30, size = (10,3))
df1 = pd.DataFrame(m,columns=["var1","var2","var3"])
df1

   var1  var2  var3
0    29    17    11
1    11     9     6
2    17    29     1
3     1    27    19
4    21    13    29
5    21    14    24
6    28    19    11
7    12     3     4
8    19    12    29
9     9     7     4

In [18]:
#Loc/iLoc

In [21]:
2 in df

False

In [22]:
?np.random.randint

In [ ]:
#Loc: Tanımlandığı şekli ile seçim yapmak için kullanılır.

In [23]:
df.loc[0:3]#İndexlemeye sadık kalacak şekilde seçim imkanı verir

   var1  var2  var3
0    12    15    10
1     3    29    11
2    29    27    21
3     6     5    18

In [ ]:
#İloc: Alışık olduğumuz indexleme mantığı ile seçim yapar.

In [24]:
df.iloc[0:3]

   var1  var2  var3
0    12    15    10
1     3    29    11
2    29    27    21

In [25]:
#İloc ile loc arasındaki farkı anladım. Biri normal indexleme mantığı ile çalışır. Diğeri Farklı olarak sondaki sayıyıda alır.

In [26]:
df.loc[0:3,"var1":"var2"]# Bu işlem iloc da geçerli değildir.

   var1  var2
0    12    15
1     3    29
2    29    27
3     6     5

In [27]:
# Koşullu eleman işlemleri

In [30]:
df["var1"][0:3]

0    12
1     3
2    29
Name: var1, dtype: int32

In [32]:
df[0:4]["var2"]

0    15
1    29
2    27
3     5
Name: var2, dtype: int32

In [34]:
df[["var1","var2"]][0:5]

   var1  var2
0    12    15
1     3    29
2    29    27
3     6     5
4    19     1

In [35]:
df[df.var1>15]

   var1  var2  var3
2    29    27    21
4    19     1    12
5    26    17    16

In [37]:
df[df.var1>15]["var2"]

2    27
4     1
5    17
Name: var2, dtype: int32

In [41]:
df[(df.var1>15) & (df.var3<15)]

   var1  var2  var3
4    19     1    12

In [ ]:
#Koşul esnasında değişken seçmekde istersek Loc kullanmamız gerekir

In [42]:
#Birleştirme İşlemleri

In [53]:
df2 = df1+99
df2

   var1  var2  var3
0   128   116   110
1   110   108   105
2   116   128   100
3   100   126   118
4   120   112   128
5   120   113   123
6   127   118   110
7   111   102   103
8   118   111   128
9   108   106   103

In [46]:
pd.concat([df1,df2])

   var1  var2  var3
0     7    21    18
1    26    29    14
2    22     2    28
3    29    14    12
4    21     3    22
5     3     3    15
6     2    29    14
7    12    11    27
8    24    17    22
9    21    22    15
0   106   120   117
1   125   128   113
2   121   101   127
3   128   113   111
4   120   102   121
5   102   102   114
6   101   128   113
7   111   110   126
8   123   116   121
9   120   121   114

In [54]:
pd.concat([df1,df2],ignore_index=True)  #Birleştirme ignore ise indexlemeyi sıralı yapar. Defalt değeri False'dur.

    var1  var2  var3
0     29    17    11
1     11     9     6
2     17    29     1
3      1    27    19
4     21    13    29
5     21    14    24
6     28    19    11
7     12     3     4
8     19    12    29
9      9     7     4
10   128   116   110
11   110   108   105
12   116   128   100
13   100   126   118
14   120   112   128
15   120   113   123
16   127   118   110
17   111   102   103
18   118   111   128
19   108   106   103

In [58]:
df2.columns = ["var1","var2","deg3"]
df2.columns

Index(['var1', 'var2', 'deg3'], dtype='object')

In [56]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [59]:
pd.concat( [df1,df2])

C:\Users\koklu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN    29    17  11.0
1    NaN    11     9   6.0
2    NaN    17    29   1.0
3    NaN     1    27  19.0
4    NaN    21    13  29.0
5    NaN    21    14  24.0
6    NaN    28    19  11.0
7    NaN    12     3   4.0
8    NaN    19    12  29.0
9    NaN     9     7   4.0
0  110.0   128   116   NaN
1  105.0   110   108   NaN
2  100.0   116   128   NaN
3  118.0   100   126   NaN
4  128.0   120   112   NaN
5  123.0   120   113   NaN
6  110.0   127   118   NaN
7  103.0   111   102   NaN
8  128.0   118   111   NaN
9  103.0   108   106   NaN

In [61]:
pd.concat([df1,df2],join="inner") #Kesişimlerine göre birleştirme işlemi yaptı

   var1  var2
0    29    17
1    11     9
2    17    29
3     1    27
4    21    13
5    21    14
6    28    19
7    12     3
8    19    12
9     9     7
0   128   116
1   110   108
2   116   128
3   100   126
4   120   112
5   120   113
6   127   118
7   111   102
8   118   111
9   108   106

In [63]:
pd.concat([df1,df2],join_axes=[df1.columns],ignore_index=True)# Burada da df1e göre birleştirme işlemi yapar.

    var1  var2  var3
0     29    17  11.0
1     11     9   6.0
2     17    29   1.0
3      1    27  19.0
4     21    13  29.0
5     21    14  24.0
6     28    19  11.0
7     12     3   4.0
8     19    12  29.0
9      9     7   4.0
10   128   116   NaN
11   110   108   NaN
12   116   128   NaN
13   100   126   NaN
14   120   112   NaN
15   120   113   NaN
16   127   118   NaN
17   111   102   NaN
18   118   111   NaN
19   108   106   NaN

In [64]:
#İleri Birleştirme İşlemleri

In [70]:
df1 = pd.DataFrame({'calisanlar':["ali","veli","ayse","Fatma"],
                   'Grup':["muhasebe","muhendislik","muhendislik","İK"]})
df1

  calisanlar         Grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      Fatma           İK

In [68]:
df2 = pd.DataFrame({'calisanlar':["ayse","ali","veli","Fatma"],
                   'ilk_giris':[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       ayse       2010
1        ali       2009
2       veli       2014
3      Fatma       2019

In [71]:
pd.merge(df1,df2) # Birebir Birleştirme

  calisanlar         Grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      Fatma           İK       2019

In [72]:
pd.merge(df1,df2, on="calisanlar")

  calisanlar         Grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      Fatma           İK       2019

In [73]:
#Çoktan Teke

In [75]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         Grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      Fatma           İK       2019

In [82]:
df4 =  pd.DataFrame({'grup':["muhasebe","muhendislik","İK"],
                   'müdür':["Caner","Mustafa","Berkcan"]})
df4

          grup    müdür
0     muhasebe    Caner
1  muhendislik  Mustafa
2           İK  Berkcan

In [84]:
#Çoktan Çoka